/*
Check if today is a day off using logical OR (||)

Write a program that asks the user whether today is a weekend (yes or no)
and whether today is a holiday (yes or no). Use the logical OR operator (||)
to check if today is a day off. If at least one condition is true, print
"Today is a day off", otherwise print "Today is a workday".

Requirements:
• The program must ask the user whether today is a weekend and store the input in a variable.
• The program must ask the user whether today is a holiday and store the input in another variable.
• The program must use the logical OR operator (||) to check whether today is a weekend or a holiday.
• If at least one condition (weekend or holiday) is true, the program must print "Сьогодні вихідний".
• If both conditions are false, the program must print "Сьогодні робочий день".

🇺🇦 Ukrainian version:

Напишіть програму, яка запитує у користувача, чи є сьогодні вихідний (yes або no)
і чи є сьогодні святковий (yes або no). Використовуйте оператор логічного АБО (||)
для перевірки, чи є сьогодні вихідним днем. Якщо хоча б одна з умов істинна,
вивести повідомлення "Сьогодні вихідний", інакше - "Сьогодні робочий день".

Вимоги:
• Програма повинна запитати у користувача, чи є сьогодні вихідним, і зберегти введене значення у змінній.
• Програма повинна запитати у користувача, чи є сьогодні святковим днем, і зберегти введене значення в іншій змінній.
• Програма повинна використовувати оператор логічного АБО (||) для перевірки, чи є сьогодні вихідним або святковим днем.
• Якщо хоча б одна з умов (вихідний або святковий день) істинна, програма повинна вивести повідомлення "Сьогодні вихідний".
• Якщо обидві умови хибні, програма повинна вивести повідомлення "Сьогодні робочий день".

Write your code here
*/

// Запитуємо у користувача, чи є сьогодні вихідним
const stringWeekend = prompt("Сьогодні вихідний? (yes/no)");
//TODO:
const weekend = (stringWeekend.trim().toLowerCase() === 'yes')

// Запитуємо у користувача, чи є сьогодні святковим днем
const stringHoliday = prompt("Сьогодні святковий день? (yes/no)");
//TODO:
const holiday = (stringHoliday.trim().toLowerCase() === 'yes')

// Перевіряємо умови та виводимо відповідне повідомлення
//TODO:
if (weekend || holiday) {
    console.log("Сьогодні вихідний");
} else {
    console.log("Сьогодні робочий день")
}